#include "CommonFunc.h"
#include "stdio.h"

/*
VOID ExAcquirePushLockShared (
	IN PEX_PUSH_LOCK_S PushLock
	)
{
	EX_PUSH_LOCK_S OldValue, NewValue;

	OldValue.Value = 0;
	NewValue.Value = EX_PUSH_LOCK_SHARE_INC|EX_PUSH_LOCK_LOCK;

	if (InterlockedCompareExchangePointer (&PushLock->Ptr,
		NewValue.Ptr,
		OldValue.Ptr) != OldValue.Ptr) {
			ExfAcquirePushLockShared (PushLock);
	}
}

VOID ExfAcquirePushLockShared (
     __inout PEX_PUSH_LOCK_S PushLock
     )
{
    EX_PUSH_LOCK_S OldValue, NewValue, TopValue;
    EX_PUSH_LOCK_WAIT_BLOCK WaitBlock;
    BOOLEAN Optimize;

    OldValue = ReadForWriteAccess (PushLock);

    while (1) {
        //
        // If the lock is already held we need to wait if its not held shared
        //
        if (!OldValue.Locked || (!OldValue.Waiting && OldValue.Shared > 0)) {

            if (OldValue.Waiting) {
                NewValue.Value = OldValue.Value + EX_PUSH_LOCK_LOCK;
            } else {
                NewValue.Value = (OldValue.Value + EX_PUSH_LOCK_SHARE_INC) | EX_PUSH_LOCK_LOCK;
            }
            ASSERT (NewValue.Locked);
            NewValue.Ptr = InterlockedCompareExchangePointer (&PushLock->Ptr,
                                                              NewValue.Ptr,
                                                              OldValue.Ptr);
            if (NewValue.Ptr == OldValue.Ptr) {
                break;
            }

        } else {
            WaitBlock.Flags = EX_PUSH_LOCK_FLAGS_SPINNING;

    BranchTarget - Supplies the calculated target address of the thunk.

    PermitStackExecution - Indicates whether the thunk may reside on the
        stack.

Return Value:

    Returns TRUE if execution of the thunk is permitted, FALSE otherwise.

Environment:

    PASSIVE_LEVEL, arbitrary thread context.  Address space lock not taken.

--*/

{
    PEPROCESS_S CurrentProcess;
    BOOLEAN RetValue;
    PMMVAD InstructionVad;
    PMMVAD StackVad;
    PMMVAD TargetVad;

    UNREFERENCED_PARAMETER (InstructionPointer);
    UNREFERENCED_PARAMETER (StackPointer);

    CurrentProcess = (PEPROCESS_S)PsGetCurrentProcess ();
    RetValue = TRUE;

    ExAcquirePushLockShared (&CurrentProcess->AddressCreationLock);

    if (PermitStackExecution == FALSE) {

        //
        // Ensure that the instruction pointer does not refer to the
        // same VAD as the stack pointer.
        //
        // And that the instruction pointer does not reside in an
        // image section.
        //

        InstructionVad = MiLocateAddress (InstructionPointer);
        StackVad = MiLocateAddress (StackPointer);

        if ((InstructionVad == NULL) ||
            (StackVad == NULL) ||
            (InstructionVad == StackVad) ||
            (InstructionVad->u.VadFlags.VadType == VadImageMap)) {

            RetValue = FALSE;
        }
    }

    if (RetValue != FALSE) {

        //
        // Ensure that the branch target is backed by an image section.
        //
            
        TargetVad = MiLocateAddress (BranchTarget);
        if (TargetVad == NULL ||
            TargetVad->u.VadFlags.VadType != VadImageMap) {

            RetValue = FALSE;
        }
    }

    ExReleasePushLockShared(&CurrentProcess->AddressCreationLock);

    return RetValue;
}

LOGICAL
KiEmulateAtlThunk (
    IN OUT ULONG *InstructionPointer,
    IN OUT ULONG *StackPointer,
    IN OUT ULONG *Eax,
    IN OUT ULONG *Ecx,
    IN OUT ULONG *Edx
    )

/*++

Routine Description:

    This routine is called to determine whether the 32-bit X86 IStream
    contains a recognized ATL thunk sequence and if so, performs
    the emulation.

Arguments:

    InstructionPointer - Supplies a pointer to the value of the 32-bit
        instruction pointer at the time of the fault.

    StackPointer - Supplies a pointer to the value of the 32-bit stack
        pointer at the time of the fault.

    Ecx - Supplies a pointer to the value of ecx at the time of the fault.

    Edx - Supplies a pointer to the value of edx at the time of the fault.

Return Value:

    Returns TRUE if an ATL thunk was recognized and emulated, FALSE if not.


    It is up to the caller to first ensure:

    - The fault occured while executing 32-bit code
    - The fault occured as a result of attempting to execute NX code

--*/

{
    LONG branchTarget;
    LONG imm32;
    PVOID rip;
    PUCHAR rsp;
    BOOLEAN safeThunkCall;
    BOOLEAN *safeThunkCallPtr;
    LOGICAL validThunk;

    //
    // Three types of ATL thunks of interest
    //

    #pragma pack(1)

    struct {
        LONG Mov;           // 0x042444C7   mov [esp+4], imm32
        LONG MovImmediate;
        UCHAR Jmp;          // 0xe9         jmp imm32
        LONG JmpImmediate;
    } *thunk1;

    struct {
        UCHAR Mov;          // 0xb9         mov ecx, imm32
        LONG EcxImmediate;
        UCHAR Jmp;          // 0xe9         jmp imm32
        LONG JmpImmediate;
    } *thunk2;

    struct {
        UCHAR MovEdx;       // 0xba         mov edx, imm32
        LONG EdxImmediate;
        UCHAR MovEcx;       // 0xb9         mov ecx, imm32
        LONG EcxImmediate;
        USHORT JmpEcx;      // 0xe1ff       jmp ecx
    } *thunk3;

    struct {
        UCHAR MovEcx;       // 0xb9         mov ecx, imm32
        LONG EcxImmediate;
        UCHAR MovEax;       // 0xb8         mov eax, imm32
        LONG EaxImmediate;
        USHORT JmpEax;      // 0xe0ff       jmp eax
    } *thunk4;

    struct {
        UCHAR PopEcx;       // 0x59
        UCHAR PopEax;       // 0x58
        UCHAR PushEcx;      // 0x51
        UCHAR Jmp[3];       // 0xFF 0x60 0x04   jmp [eax+4]
    } *thunk7;

    #pragma pack()

    rip = UlongToPtr(*InstructionPointer);
    rsp = UlongToPtr(*StackPointer);

    thunk1 = rip;
    thunk2 = rip;
    thunk3 = rip;
    thunk4 = rip;
    thunk7 = rip;

    validThunk = FALSE;

    //
    // If thunk emulation is disabled, then do not attempt to emulate any
    // thunks.
    //

    if (KiQueryNxThunkEmulationState() != 0) {
        return FALSE;
    }

    //
    // Carefully examine the instruction stream.  If it matches a known
    // ATL thunk template, then emulate it.
    //

    try {
        ProbeAndReadUchar((PUCHAR)rip);

        safeThunkCall = *safeThunkCallPtr;
        if (safeThunkCall != FALSE) {
            *safeThunkCallPtr = FALSE;
        }

        if ((thunk1->Mov == 0x042444C7) && (thunk1->Jmp == 0xe9)) {

            //
            // Type 1 thunk.
            //

            //
            // emulate: jmp imm32
            //

